window.MAYRAIL_NEWS = {
  posts: [
    {
      id: "1",
      published: true,
      title: "Платформа Первомайск-1 будет закрыта",
      date: "2026-05-17",
      image: "assets/img/news/1.jpg",
      imageAlt: "",
      excerpt: "В связи с затруднённой организацией движения на данном участке платформа Первомайск-1 закрывается. \n Платформа Первомайск-2 будет переименована в Первомайск. \n Пассажирам рекомендуется пользоваться платформами Первомайск и Компост.",
      content: "В связи с затруднённой организацией движения на данном участке платформа Первомайск-1 закрывается. \n Платформа Первомайск-2 будет переименована в Первомайск. \n Пассажирам рекомендуется пользоваться платформами Первомайск и Компост."
    },
    {
      id: "2",
      published: true,
      title: "Переименование станций",
      date: "2025-07-12",
      image: "assets/img/news/2.jpg",
      imageAlt: "",
      excerpt: "В связи с запланированным на август строительством ветки Первомайск-Товарный - Колодец, а также обустройством местной инфраструктуры вблизи станции Первомайск-Товарный, было принято решение переорганизовать движение и перестроить станции Первомайск-Товарный и Первомайск-Пассажирский. \n В ходе переорганизации, станция Первомайск-Товарный будет переименована в Первомайск-2, а станция Первомайск-Пассажирский будет переименована в Первомайск-1.",
      content: "В связи с запланированным на август строительством ветки Первомайск-Товарный - Колодец, а также обустройством местной инфраструктуры вблизи станции Первомайск-Товарный, было принято решение переорганизовать движение и перестроить станции Первомайск-Товарный и Первомайск-Пассажирский. \n В ходе переорганизации, станция Первомайск-Товарный будет переименована в Первомайск-2, а станция Первомайск-Пассажирский будет переименована в Первомайск-1. \n Это позволит перенаправить пассажиропоток со станции Первомайск-1 на станцию Первомайск-2, что значительно упростит пересадку между двумя направлениями, улучшит организацию маневровых работ с грузовыми поездами, а также частично решит проблему безопасности на переходе возле платформы Первомайск-1, в ходе которой стоящие на платформе поезда блокировали переход."
    },
    {
      id: "3",
      published: true,
      title: "Начнём работу с августа!",
      date: "2025-07-11",
      image: "assets/img/news/3.jpg",
      imageAlt: "",
      excerpt: "Сезон Первомайских железных дорог начнется уже в августе! Следите за сайтом, чтобы быть в курсе всех последних событий!",
      content: "Сезон Первомайских железных дорог начнется уже в августе! Следите за сайтом, чтобы быть в курсе всех последних событий!"
    }
  ]
};
